app/views/OWS/Name/InsertEmail.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:name="http://webservices.micros.com/ows/5.1/Name.wsdl">
   <soapenv:Header>
      <core:OGHeader transactionID="{transactionID}" primaryLangID="E" timeStamp="{timeStamp}" xmlns="http://webservices.micros.com/og/4.3/Core/">
         <core:Origin entityID="{hotelCode}" systemType="WEB"/>
         <core:Destination entityID="{hotelCode}" systemType="PMS"/>
      </core:OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <name:InsertEmailRequest>
      	 <name:NameID type="INTERNAL">{NameID}</name:NameID>
         <name:NameEmail>{NameEmail}</name:NameEmail>
      </name:InsertEmailRequest>
   </soapenv:Body>
</soapenv:Envelope>